{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "word_emb", "trainable": true, "batch_input_shape": [null, 500], "input_dtype": "int32", "input_dim": 216, "output_dim": 200, "init": "uniform", "input_length": 500, "mask_zero": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": null, "input_length": null, "output_dim": 200, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "TimeDistributed", "config": {"name": "timedistributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 5, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 400}}}}, {"class_name": "ChainCRF", "config": {"name": "chaincrf_1", "trainable": true, "init": "glorot_uniform", "U_regularizer": null, "b_start_regularizer": null, "b_end_regularizer": null, "U_constraint": null, "b_start_constraint": null, "b_end_constraint": null}}], "keras_version": "1.2.2"}